* ### 같은 카테고리의 데이터끼리 분류하여 연산하기

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df=sns.load_dataset("mpg")
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [9]:
# 사이즈측정
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [10]:
# groupby없이 사이즈측정
df["origin"].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [14]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [15]:
df.groupby(by="origin").max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [16]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [3]:
df.groupby(by="origin").median()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,26.5,4,104.5,76.5,2240,15.7,76
japan,31.6,4,97.0,75.0,2155,16.4,78
usa,18.5,6,250.0,105.0,3365,15.0,76

In [20]:
# df.pivot()과 유사하다.
# pandas cheatsheet에 나와있지 않은 내용이다.
# df.pivot_table?
# df.groupby?

### groupby를 이용한
### model_year열과 origin열의
### cylinders에 대한 평균값 그룹화

In [4]:
# model_year과 origin에 대해여 그룹화를 시키고 cylinders의 평균값 구하기
pd.DataFrame(df.groupby(
                        ['model_year','origin']
                        )['cylinders'].mean().head())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000

* ### shift : 행 이동해서 덮어씌우기
### (이동해서 빈 값은 결측치 처리됨)
### (결측치 처리할 때 유용하게 사용한다)
### 만약 하나의 컬럼만 비어있는데 전의 값이나 후의 값으로 채우고 싶다고 한다면, 새로운 컬럼을 만들고 shift 값을 넣은 다음에 비어있는 값을 shift 값에서 가져오면 된다.

In [5]:
df2 = pd.DataFrame(
[[4, 7, 10],
[5, 11, 4],
[6, 6, 2]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df2

   a   b   c
1  4   7  10
2  5  11   4
3  6   6   2

In [28]:
df2.shift(1)

     a    b     c
1  NaN  NaN   NaN
2  4.0  7.0  10.0
3  5.0  8.0  11.0

In [29]:
df2.shift(-1)

     a    b     c
1  5.0  8.0  11.0
2  6.0  9.0  12.0
3  NaN  NaN   NaN

In [30]:
df2['a'].shift(1)

1    NaN
2    4.0
3    5.0
Name: a, dtype: float64

In [31]:
df2['b'].shift(2)

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

In [35]:
# 최소값 순으로 순위내기
df["model_year"].rank(method='min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
339.0    29
281.0    29
310.0    29
1.0      29
217.0    28
58.0     28
30.0     28
126.0    27
Name: model_year, dtype: int64

In [43]:
# 최소값 순으로 순위내기
df["model_year"].rank(method='max')

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [33]:
# 밀집도 순으로 순위내기
df["model_year"].rank(method='dense')

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
393    13.0
394    13.0
395    13.0
396    13.0
397    13.0
Name: model_year, Length: 398, dtype: float64

In [44]:
# pct : 퍼센트(%)를 의미한다. 비율을 볼 수 있다.
df["model_year"].rank(pct=True)

0      0.037688
1      0.037688
2      0.037688
3      0.037688
4      0.037688
         ...
393    0.962312
394    0.962312
395    0.962312
396    0.962312
397    0.962312
Name: model_year, Length: 398, dtype: float64

In [45]:
# 첫 번째 값부터 차례대로 순위를 매긴다.
df["model_year"].rank(method='first')

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
       ...
393    394.0
394    395.0
395    396.0
396    397.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [46]:
# cumsum : 누적합 추출하기
df2.cumsum()

    a   b   c
1   4   7  10
2   9  15  21
3  15  24  33

In [49]:
# cummax : 최대값 추출하기
df2.cummax()

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  10

In [6]:
# cummax : 최소값 추출하기
df2.cummin()

   a  b   c
1  4  7  10
2  4  7   4
3  4  6   2

In [7]:
# cumprod : 누적곱 추출하기
df2.cumprod()

     a    b   c
1    4    7  10
2   20   77  40
3  120  462  80